###################################################################################
###################################################################################

CNN + Seq-LSTM Model Summary ::
*******************************

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 21, 100)           2585100   
_________________________________________________________________
conv1d (Conv1D)              (None, 21, 64)            19264     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 10, 64)            0         
_________________________________________________________________
dropout (Dropout)            (None, 10, 64)            0         
_________________________________________________________________
lstm (LSTM)                  (None, 10, 128)           98816     
_________________________________________________________________
dropout_1 (Dropout)          (None, 10, 128)           0         
_________________________________________________________________
flatten (Flatten)            (None, 1280)              0         
_________________________________________________________________
dense (Dense)                (None, 128)               163968    
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_2 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 66        
=================================================================
Total params: 2,877,550
Trainable params: 2,877,550
Non-trainable params: 0
_________________________________________________________________

##############################################################################################
##############################################################################################

CNN + Seq-LSTM Model Training ::
********************************

Epoch 1/6
1738/1738 - 36s - loss: 0.1859 - accuracy: 0.9191 - val_loss: 0.1126 - val_accuracy: 0.9629
Epoch 2/6
1738/1738 - 32s - loss: 0.0690 - accuracy: 0.9757 - val_loss: 0.1041 - val_accuracy: 0.9599
Epoch 3/6
1738/1738 - 31s - loss: 0.0416 - accuracy: 0.9854 - val_loss: 0.1264 - val_accuracy: 0.9606
Epoch 4/6
1738/1738 - 32s - loss: 0.0267 - accuracy: 0.9902 - val_loss: 0.1162 - val_accuracy: 0.9609
Epoch 5/6
1738/1738 - 31s - loss: 0.0184 - accuracy: 0.9935 - val_loss: 0.1673 - val_accuracy: 0.9591
Epoch 6/6
1738/1738 - 31s - loss: 0.0138 - accuracy: 0.9953 - val_loss: 0.1705 - val_accuracy: 0.9553

##############################################################################################
##############################################################################################