###################################################################################
###################################################################################

CNN + Bi-LSTM Model Summary ::
******************************

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 22, 100)           3058800   
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 22, 64)            19264     
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 11, 64)            0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 11, 64)            0         
_________________________________________________________________
bidirectional (Bidirectional (None, 11, 256)           197632    
_________________________________________________________________
dropout_4 (Dropout)          (None, 11, 256)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2816)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 128)               360576    
_________________________________________________________________
dropout_5 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_6 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_7 (Dense)              (None, 2)                 66        
=================================================================
Total params: 3,646,674
Trainable params: 3,646,674
Non-trainable params: 0
_________________________________________________________________

##############################################################################################
##############################################################################################

CNN + Bi-LSTM Model Training ::
*******************************

Epoch 1/6
2158/2158 - 51s - loss: 0.1820 - accuracy: 0.9255 - val_loss: 0.1051 - val_accuracy: 0.9620
Epoch 2/6
2158/2158 - 50s - loss: 0.0718 - accuracy: 0.9742 - val_loss: 0.1053 - val_accuracy: 0.9588
Epoch 3/6
2158/2158 - 53s - loss: 0.0420 - accuracy: 0.9851 - val_loss: 0.1120 - val_accuracy: 0.9613
Epoch 4/6
2158/2158 - 53s - loss: 0.0279 - accuracy: 0.9903 - val_loss: 0.1294 - val_accuracy: 0.9593
Epoch 5/6
2158/2158 - 54s - loss: 0.0194 - accuracy: 0.9931 - val_loss: 0.1406 - val_accuracy: 0.9575
Epoch 6/6
2158/2158 - 53s - loss: 0.0144 - accuracy: 0.9951 - val_loss: 0.1908 - val_accuracy: 0.9581

##############################################################################################
##############################################################################################