###################################################################################
###################################################################################

CNN + Seq-LSTM Model Summary ::
*******************************

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 22, 100)           3058800   
_________________________________________________________________
conv1d (Conv1D)              (None, 22, 64)            19264     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 11, 64)            0         
_________________________________________________________________
dropout (Dropout)            (None, 11, 64)            0         
_________________________________________________________________
lstm (LSTM)                  (None, 11, 128)           98816     
_________________________________________________________________
dropout_1 (Dropout)          (None, 11, 128)           0         
_________________________________________________________________
flatten (Flatten)            (None, 1408)              0         
_________________________________________________________________
dense (Dense)                (None, 128)               180352    
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_2 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 66        
=================================================================
Total params: 3,367,634
Trainable params: 3,367,634
Non-trainable params: 0
_________________________________________________________________

##############################################################################################
##############################################################################################

CNN + Seq-LSTM Model Training ::
********************************

Epoch 1/6
2158/2158 - 61s - loss: 0.1683 - accuracy: 0.9305 - val_loss: 0.1013 - val_accuracy: 0.9634
Epoch 2/6
2158/2158 - 47s - loss: 0.0665 - accuracy: 0.9760 - val_loss: 0.1065 - val_accuracy: 0.9633
Epoch 3/6
2158/2158 - 42s - loss: 0.0407 - accuracy: 0.9859 - val_loss: 0.1180 - val_accuracy: 0.9578
Epoch 4/6
2158/2158 - 41s - loss: 0.0282 - accuracy: 0.9898 - val_loss: 0.1329 - val_accuracy: 0.9574
Epoch 5/6
2158/2158 - 41s - loss: 0.0199 - accuracy: 0.9932 - val_loss: 0.1589 - val_accuracy: 0.9537
Epoch 6/6
2158/2158 - 41s - loss: 0.0135 - accuracy: 0.9953 - val_loss: 0.2106 - val_accuracy: 0.9561

##############################################################################################
##############################################################################################