###################################################################################
###################################################################################

CNN + Bi-LSTM Model Summary ::
******************************

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 21, 100)           2585100   
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 21, 64)            19264     
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 10, 64)            0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 10, 64)            0         
_________________________________________________________________
bidirectional (Bidirectional (None, 10, 256)           197632    
_________________________________________________________________
dropout_4 (Dropout)          (None, 10, 256)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2560)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 128)               327808    
_________________________________________________________________
dropout_5 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_6 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_7 (Dense)              (None, 2)                 66        
=================================================================
Total params: 3,140,206
Trainable params: 3,140,206
Non-trainable params: 0
_________________________________________________________________

##############################################################################################
##############################################################################################

CNN + Bi-LSTM Model Training ::
*******************************

Epoch 1/6
1738/1738 - 37s - loss: 0.1838 - accuracy: 0.9218 - val_loss: 0.0993 - val_accuracy: 0.9665
Epoch 2/6
1738/1738 - 35s - loss: 0.0676 - accuracy: 0.9763 - val_loss: 0.1198 - val_accuracy: 0.9619
Epoch 3/6
1738/1738 - 35s - loss: 0.0392 - accuracy: 0.9865 - val_loss: 0.1050 - val_accuracy: 0.9638
Epoch 4/6
1738/1738 - 35s - loss: 0.0263 - accuracy: 0.9907 - val_loss: 0.1211 - val_accuracy: 0.9587
Epoch 5/6
1738/1738 - 35s - loss: 0.0172 - accuracy: 0.9944 - val_loss: 0.1400 - val_accuracy: 0.9584
Epoch 6/6
1738/1738 - 37s - loss: 0.0139 - accuracy: 0.9950 - val_loss: 0.1434 - val_accuracy: 0.9575

##############################################################################################
##############################################################################################